<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.140">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7"/>
  <Typedef id="_2" name="__int128_t" type="_8" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Function id="_7" name="add" returns="_13" context="_1" location="f1:2" file="f1" line="2" mangled="_Z3add">
    <Argument name="a" type="_13" location="f1:2" file="f1" line="2"/>
    <Argument name="b" type="_13" location="f1:2" file="f1" line="2"/>
  </Function>
  <FundamentalType id="_8" name="__int128" size="128" align="128"/>
  <FundamentalType id="_9" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_10" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_14 _15 _16 _17" size="256" align="64"/>
  <PointerType id="_11" type="_18" size="64" align="64"/>
  <ArrayType id="_12" min="0" max="0" type="_19"/>
  <FundamentalType id="_13" name="int" size="32" align="32"/>
  <Field id="_14" name="isa" type="_20" context="_10" access="public" offset="0"/>
  <Field id="_15" name="flags" type="_13" context="_10" access="public" offset="64"/>
  <Field id="_16" name="str" type="_21" context="_10" access="public" offset="128"/>
  <Field id="_17" name="length" type="_22" context="_10" access="public" offset="192"/>
  <Struct id="_19" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_23 _24 _25 _26" size="192" align="64"/>
  <PointerType id="_20" type="_13c" size="64" align="64"/>
  <CvQualifiedType id="_13c" type="_13" const="1"/>
  <PointerType id="_21" type="_18c" size="64" align="64"/>
  <CvQualifiedType id="_18c" type="_18" const="1"/>
  <FundamentalType id="_22" name="long int" size="64" align="64"/>
  <Field id="_23" name="gp_offset" type="_27" context="_19" access="public" offset="0"/>
  <Field id="_24" name="fp_offset" type="_27" context="_19" access="public" offset="32"/>
  <Field id="_25" name="overflow_arg_area" type="_28" context="_19" access="public" offset="64"/>
  <Field id="_26" name="reg_save_area" type="_28" context="_19" access="public" offset="128"/>
  <FundamentalType id="_27" name="unsigned int" size="32" align="32"/>
  <PointerType id="_28" type="_29" size="64" align="64"/>
  <FundamentalType id="_18" name="char" size="8" align="8"/>
  <FundamentalType id="_29" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="test8.c"/>
</GCC_XML>
